[
    {
        "reviewerID": "A3EBHHCZO6V2A4",
        "asin": "5555991584",
        "reviewerName": "Amaranth \"music fan\"",
        "helpful": [3, 3],
        "reviewText": "It's hard to believe \"Memory of Trees\" came out 11 years ago;it has held up well over the passage of time.It's Enya's last great album before the New Age/pop of \"Amarantine\" and \"Day without rain.\" Back in 1995,Enya still had her creative spark,her own voice.I agree with the reviewer who said that this is her saddest album;it is melancholy,bittersweet,from the opening title song.\"Memory of Trees\" is elegaic&majestic.;\"Pax Deorum\" sounds like it is from a Requiem Mass,it is a dark threnody.Unlike the reviewer who said that this has a \"disconcerting\" blend of spirituality&sensuality;,I don't find it disconcerting at all.\"Anywhere is\" is a hopeful song,looking to possibilities.\"Hope has a place\" is about love,but it is up to the listener to decide if it is romantic,platonic,etc.I've always had a soft spot for this song.\"On my way home\" is a triumphant ending about return.This is truly a masterpiece of New Age music,a must for any Enya fan!",
        "overall": 5.0,
        "summary": "Enya's last great album",
        "unixReviewTime": 1158019200,
        "reviewTime": "09 12, 2006"
    },
    {
        "reviewerID": "AZPWAXJG9OJXV",
        "asin": "5555991584",
        "reviewerName": "bethtexas",
        "helpful": [0, 0],
        "reviewText": "A clasically-styled and introverted album, Memory of Trees is a masterpiece of subtlety. Many of the songs have an endearing shyness to them -soft piano and a lovely, quiet voice. But within every introvert is an inferno, and Enya lets that fire explode on a couple of songs that absolutely burst with an expected raw power.If you've never heard Enya before, you might want to start with one of her more popularized works, like Watermark, just to play it safe. But if you're already a fan, then your collection is not complete without this beautiful work of musical art.",
        "overall": 5.0,
        "summary": "Enya at her most elegant",
        "unixReviewTime": 991526400,
        "reviewTime": "06 3, 2001"
    }
]