[{"rating": 5.0, "title": "Nice", "text": "If i had a dollar for how many times I have played this cd and how many times I have asked Alexa to play it, I would be rich. Love this singer along with the Black Pumas. Finding a lot of new music that I like a lot on amazon. Try new things.", "images": [], "asin": "B004RQ2IRG", "parent_asin": "B004RQ2IRG", "user_id": "AFUOYIZBU3MTBOLYKOJE5Z35MBDA", "timestamp": 1618972613292, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "Excellent", "text": "awesome sound - cant wait to see them in person - always miss them when they are in town !", "images": [], "asin": "B0026UZEI0", "parent_asin": "B0026UZEI0", "user_id": "AHGAOIZVODNHYMNCBV4DECZH42UQ", "timestamp": 1308167525000, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "Great service", "text": "This is a great cd. Good music and plays well. Seller responded back very quicky and  received it within 3 days", "images": [], "asin": "B0055JSYHC", "parent_asin": "B0055JSYHC", "user_id": "AFGEM6BXCYHUILEOA3P2ZYBEF2TA", "timestamp": 1615838793006, "helpful_vote": 0, "verified_purchase": true},
{"rating": 1.0, "title": "No good", "text": "These are not real German singers, they have accents. It is nothing what they advertised it. Music stinks.", "images": [], "asin": "B000F9SMUQ", "parent_asin": "B000F9SMUQ", "user_id": "AH3OG6QD6EDJGZRVCFKV4B66VWNQ", "timestamp": 1405219741000, "helpful_vote": 0, "verified_purchase": true},
{"rating": 3.0, "title": "Cool concept, so-so execution...", "text": "I first heard this playing in a Nagoya shop and fell in love with the remix of Ke$ha's \"Tik Tok\" (Ke$ha and Lady Gaga are EVERYWHERE in Japan), which then morphed into several other recent pop hits. When the salesgirl handed me the CD, I was pleased to see that it actually included thirty pop songs by the likes of Lady Gaga, Usher, La Roux, Katy Perry, Black-Eyed Peas, Ke$ha, etc. I researched more after I got home, and discovered that this Japanese label (Manhattan Records) exists solely to put out rerecorded and remixed dance CDs based on recent pop hits, the key word being rerecorded. I guessed as much as I was listening to the CD in-store; several of the soundalikes do a great job, others are just so-so. It's great for workouts, though, since the tracks fade one into another with no downtime (the bad side is that if you've got in in shuffle, the beginning of the next song, which is often in a different key, is kind of an awkward fade-out when not played in sequence).", "images": [], "asin": "B0049D1WVK", "parent_asin": "B0049D1WVK", "user_id": "AFW2PDT3AMT4X3PYQG7FJZH5FXFA", "timestamp": 1309029595000, "helpful_vote": 0, "verified_purchase": false},
{"rating": 4.0, "title": "\"L'attaque des clones\" a satisfying taste of things to come.", "text": "I just saw \"Star Wars: L'attaque des clones\" last night (in Ste-Foy, Québec) at a sold-out show (it was playing in English at the theatre next door but I opted for the French version instead). First of all, the theatre itself was an experience: an immense screen that looked as large as an IMAX screen, intense surround THX sound, and the digital picture (even at that size) was amazingly crisp, the colours vibrant, and the sound effects were ear-splitting and exhilarating (especially the moments of silence that preceded the sonic depth charge explosions!)<br />I have seen the other four Star Wars movies but avoided reading publicity and reviews for \"Attack of the Clones\" in order to enjoy every moment without worrying over a particular critic's faults with the film. This film is much darker than \"The Phantom Menace\" could have ever aspired to be. Lucas has moved from stilted, juvenile scriptwriting on \"TPM\" to (still) stilted, mythological, more adult scriptwriting on \"Attack of the Clones.\" Here we see Anakin as a headstrong, angry, frequently obnoxious young adult who loves backtalking, disobeying orders, and getting his way--a most dangerous thing when you are destined to become the most powerful Jedi of all time.<br />The dialogue is very politically minded (I had to wonder at the \"separatist\" politics of the film, being in Québec) and the romance scenes feel wooden and awkward, but Natalie Portman and Hayden Christensen definitely have onscreen chemistry. (I have since read that Hayden purposely would flash a thumbs-up at the end of his takes so Lucas would have to reshoot the kissing scenes...I did get a laugh out of that.)<br />Jar Jar Binks has (thankfully) been reduced to a few mere minutes of screentime, in which he manages to be (awkwardly) regal and somewhat less annoying that in Episode I. My favourite part of the \"Star Wars\" universe has always been the astonishing variety of aliens and alien languages...when I was a kid I wanted to be the one that came up with all the cool sounding languages spoken in the film (I still do as a matter of fact).<br />As usual, Natalie Portman's costumes are to die for, incorporating Asian and European fashion influences while still managing to be gracefully fresh and exotic. Only one I could have done without was the black leather getup ---elbow-high leather gloves and a black leather bustier, yet she's telling Anakin she's not interested in a romantic relationship...riiiight (Curiously enough, Anakin wears black leather as well...and if you listen carefully you can hear a whole lot of leather creaking onscreen). Portman certainly runs around baring her abs-of-steel midriff for much of the film (along with being very braless in a very tight white jumpsuit, which I found tasteless and unnecessary...I mean, the costumers spent the last film and part of this one coming up with these gorgeous gowns and now they're raiding Lara Croft's closet?)<br />The CGI imagery was breathtaking, especially the chase through Coruscant, the clone army and all of the alien landscapes. John Williams' score incorporates themes from all of the previous \"Star Wars\" soundtracks, including the addition of a new love theme, \"Across the Stars.\" The fight scenes were white-knuckle intense and had me on the edge of my seat. The battle scene with all of the Jedis of all different species was *awesome,* as was Mace Windu's (Samuel L. Jackson) purple lightsaber...a first in \"Star Wars\" history. And Yoda: we finally see him in action and understand why he is the greatest living Jedi. Another first: Yoda is completely computer-animated, and is extremely lifelike.<br />The French translation of the film was almost an exact translation from the English...I actually found that some of the dialogue flowed more smoothly in French. Understanding some of the alien accents (especially the metallic robot ones) was a bit of a challenge for me, but it adds to the fun.<br />Lucas has effectively planted the seeds for the next and final chapter in the \"Star Wars\" saga, redeeming himself from the sometimes mediocre acting, wooden dialogue and annoying creatures from \"The Phantom Menace\".<br />Episode II is full of treachery, death, assassination attempts, massacres, and battles between good and evil where right and wrong are sometimes obscured. Unlike Jake Lloyd, the child actor who played Anakin in \"The Phantom Menace,\" in Hayden we see Anakin torn between his inner feelings and his obligations as a Jedi...his romance with Padmé, the (implied) massacre of the Tusken camp, and his defiance, all pointing to his shift to the Dark Side of the Force.<br />The film is rated PG, but it does contain some very intense moments: onscreen kissing and sexual tension of sorts, a decapitation, mutilation, creepy space caterpillars, a gladiator-style execution arena, a massacre and other intense battle scenes and that might be disturbing to younger children. But overall it is a very worthy addition to the \"Star Wars\" universe. Can't wait until Episode III!", "images": [], "asin": "B00003CXKT", "parent_asin": "B00003CXKT", "user_id": "AFW2PDT3AMT4X3PYQG7FJZH5FXFA", "timestamp": 1022191122000, "helpful_vote": 1, "verified_purchase": false},
{"rating": 5.0, "title": "Ronnie Dunn like I've never heard before!", "text": "This is without a doubt my favorite CD, and I may be close to wearing it out before the end of the month  LOL  Personally, I never looked at the song list, just popped it in the player and let 'er rip.  I sat back and was just amazed at the choices Ronnie made to put on this CD.  Highly recommend it to any fan of his.  And if you're not, try it, you will be !!!!!", "images": [], "asin": "B083QN4Y6H", "parent_asin": "B083QN4Y6H", "user_id": "AGYEAZK4OEYF2MSSTGJ5WNJDVZKA", "timestamp": 1592615999887, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "A true classic seventies rock album", "text": "Sounds great", "images": [], "asin": "B08L7CJ6NM", "parent_asin": "B08L7CJ6NM", "user_id": "AHB5CGLYN3Y6NIPHNQLYFJT2W2PQ", "timestamp": 1641330592178, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "A great collection of music", "text": "This disk is fantastic I wanted the record but recieved a couple bad ones so I purchased this i was not disappointed", "images": [], "asin": "B092C24W4G", "parent_asin": "B092C24W4G", "user_id": "AHB5CGLYN3Y6NIPHNQLYFJT2W2PQ", "timestamp": 1641224888411, "helpful_vote": 2, "verified_purchase": true},
{"rating": 5.0, "title": "Excellent musical experience", "text": "This is a fantastic collection of music superb musicians all Mark Soklin keyboards, Paul Soclow bass, Romero Lubambo guitar, Duduka Fonesca drums, Claudio Roditi trumpet, on Sonhos a previous reviewer  said  musicians were not listed on the CD these people inspire me to play they are all amazing  I am a guitarist and listen to lots of music but this record is spectacular", "images": [], "asin": "B01M32UHXG", "parent_asin": "B01M32UHXG", "user_id": "AHB5CGLYN3Y6NIPHNQLYFJT2W2PQ", "timestamp": 1566575806068, "helpful_vote": 0, "verified_purchase": false},
{"rating": 5.0, "title": "confusing two separate CDs", "text": "There are two separate CDs one is called sand in the vasaline one is called popular favorites that is disc two although disc two actually lists all the tracks from sand in the vasaline it is a separate disc", "images": [], "asin": "B002Q2KG1I", "parent_asin": "B002Q2KG1I", "user_id": "AHB5CGLYN3Y6NIPHNQLYFJT2W2PQ", "timestamp": 1493417280000, "helpful_vote": 0, "verified_purchase": false},
{"rating": 5.0, "title": "Great co to buy from and i am picky", "text": "It exceeds my expectations I wish all retailers where as great as  mayan", "images": [], "asin": "B003NXEPY8", "parent_asin": "B003NXEPY8", "user_id": "AHB5CGLYN3Y6NIPHNQLYFJT2W2PQ", "timestamp": 1461286805000, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "Astounding!", "text": "astoundingly beautiful, haunting, moving Chorale !!", "images": [], "asin": "B0012N3PMY", "parent_asin": "B0012N3PMY", "user_id": "AFUB7CHTXRPD447QVQCHBZVN2IPQ", "timestamp": 1563218775810, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "Five Stars", "text": "Fabulous Cd well worth purchasing...", "images": [], "asin": "B006X08FR6", "parent_asin": "B006X08FR6", "user_id": "AFGWR7GZLOWSTFN2QJBE5NMGVEGQ", "timestamp": 1446817089000, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "AM Gold the late \"60's", "text": "Very Good CD All the original songs not redone love this CD!  Well Reccomended!!! A lot of these songs I grew up with!", "images": [], "asin": "B000K4Y80O", "parent_asin": "B000K4Y80O", "user_id": "AFGWR7GZLOWSTFN2QJBE5NMGVEGQ", "timestamp": 1389267697000, "helpful_vote": 1, "verified_purchase": true},
{"rating": 5.0, "title": "when a man loves a woman", "text": "Great cd and what's nice its all of the original artists. I f you  lived during this era you will love this!", "images": [], "asin": "B0009P1NXO", "parent_asin": "B0009P1NXO", "user_id": "AFGWR7GZLOWSTFN2QJBE5NMGVEGQ", "timestamp": 1377513877000, "helpful_vote": 1, "verified_purchase": true},
{"rating": 4.0, "title": "Elvis' 1963 studio LP wasn't lost, it was maimed!", "text": "With movies taking over Elvis' post-army career, their soundtracks, naturally, became the main focus of his album release schedule.  The annual barrage of soundtrack LPs and EPs would yield enough space for just one new studio LP and one or two singles per year in his busy release schedule.  \"Elvis is Back!\" (1960), \"Something for Everybody\" (1961), \"Pot Luck\" (1962), plus the \"His Hand in Mine\" gospel album (released at Christmas, 1960 and a steady catalog seller), were all well received best-sellers.  So, when Elvis entered RCA's Studio B in Nashville in May of 1963, it was expected by fans to be for the purpose of recording a new non-movie LP to follow up the previous year's \"Pot Luck with Elvis\" album.  The big summer '63 single (Devil in Disguise) whet the fanbase appetite for a new studio LP, and then ... a Greatest Hits set (Elvis' Golden Records, Volume 3) was issued, followed by yet another soundtrack album (\"Fun in Acapulco\").  The recordings that made up what came to be known as \"The Lost Album\" would be sliced and diced and served up as various singles A-sides and B-sides, EP filler (\"Tickle Me\"), soundtrack album 'bonus songs,' and patched together album fodder (\"Elvis for Everyone!\") over the following five years.  And it's a plain shame, because it didn't have to be that way.  \"Golden Records Volume 3\" could've / should've been held back for summer '64 release since RCA didn't see fit to issue a \"Viva Las Vegas!\" soundtrack album, despite the runaway success of the movie, leaving a wide-open space in the summer '64 schedule -- the perfect slot for \"Golden Records Volume 3.\"  After \"Kissin' Cousins\" (March '64) another new Elvis LP wouldn't turn up until the \"Roustabout\" soundtrack was released in late November.  A more than worthy follow-up to the Top 5 success of \"Pot Luck,\" the so-called Lost Album would have met with great success in 1963, a time when Elvis' recording career momentum could surely have used a boost.  Sales of the recent \"It Happened at the World's Fair\" soundtrack had been tepid, by Elvis' standards.  More importantly, 'Lost' was / is a fine stand-alone album.  As was the ongoing pattern, 15 songs had been recorded: Two singles A-sides (Devil in Disguise and the planned, but ultimately unissued single Memphis, Tennessee), an immediate B-side for 'Devil' (Please Don't Drag That String Around), and a twelve-track LP deftly mixing pop, rock, love ballads, and hints of Elvis' blues and country roots.  Some 60 years down the line, it still adds up to a wonderfully eclectic collection from the guy who once said, \"I sing all kinds,\" and he was neither boasting nor kidding.  Four shining stars and definitely recommended.", "images": [], "asin": "B01KAVRPSS", "parent_asin": "B01KAVRPSS", "user_id": "AE7BV6IMNPZ3F266H7PXMH3BZQNQ", "timestamp": 1672949803634, "helpful_vote": 0, "verified_purchase": true},
{"rating": 4.0, "title": "Clapper's look back at the big ones is meant to accompany his autobiography", "text": "Import version, basically the same as the domestic release but featuring a better cover (imho).  Released originally to accompany / capitalize on the release of his autobiography. And in that sense, it's all good, I suppose, although this material has been collected and re-collected numerous times. But if you're looking to have just one Eric Clapton retrospective in your collection, this just may be the one for you.  Disc One covers the various group and early solo years.  Disc Two centers in on the Warner Brothers releases.  And not surprisingly, the first disc is the really interesting one for classic rockers. The second cd has a lot of big singles and radio hits; for the most part, however, they're not as strong as the savage young Eric.  Five stars for the casual fan, four stars for the rest of us.  Definitely recommended.", "images": [], "asin": "B09TG5NB37", "parent_asin": "B09TG5NB37", "user_id": "AE7BV6IMNPZ3F266H7PXMH3BZQNQ", "timestamp": 1667694165621, "helpful_vote": 0, "verified_purchase": false},
{"rating": 5.0, "title": "It’s wonderful, wonderful.", "text": "Mostly old standards with some new ones, very pleased with this album.", "images": [], "asin": "B07D23QW34", "parent_asin": "B07D23QW34", "user_id": "AFKJQMCY3HIYNHN3FEMLQXPGIPWA", "timestamp": 1632331411293, "helpful_vote": 1, "verified_purchase": true},
{"rating": 4.0, "title": "At the control room, good music.", "text": "Not perfect but a really good album worth while having.", "images": [{"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81sh4Fcy5lL._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81sh4Fcy5lL._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81sh4Fcy5lL._SL1600_.jpg", "attachment_type": "IMAGE"}], "asin": "B00IAFVQPA", "parent_asin": "B00IAFVQPA", "user_id": "AFKJQMCY3HIYNHN3FEMLQXPGIPWA", "timestamp": 1617059904127, "helpful_vote": 0, "verified_purchase": true},
{"rating": 5.0, "title": "So Great!", "text": "I love this... It was signed by the entire group. I love the music and book.", "images": [], "asin": "B00PG5HKCK", "parent_asin": "B00PG5HKCK", "user_id": "AH66FSBWTQC75KM2DSTCHNKVQTGQ", "timestamp": 1445213036000, "helpful_vote": 0, "verified_purchase": true}]
